eshop3/app/controllers/admin/director_controller.rb

INSERT INTO `directors` (`created_at`, `first_name`, `last_name`, `updated_at`) VALUES ('2016-04-26 08:39:07', 'Quentin', 'Tarantino', '2016-04-26 08:39:07')
---
  def create
    @director = Director.new(director_params)
    if @director.save

SELECT  `directors`.* FROM `directors`  WHERE `directors`.`id` = 6 LIMIT 1
---
  def edit
    @director = Director.find(params[:id])

SELECT  `directors`.* FROM `directors`  WHERE `directors`.`id` = 6 LIMIT 1
UPDATE `directors` SET `first_name` = 'Andy', `updated_at` = '2016-04-26 08:42:39' WHERE `directors`.`id` = 6
---
  def update
    @director = Director.find(params[:id])
    if @director.update_attributes(director_params)

SELECT  `directors`.* FROM `directors`  WHERE `directors`.`id` = 1 LIMIT 1
DELETE FROM `directors` WHERE `directors`.`id` = 1
---
  def destroy
    @director = Director.find(params[:id])
    @director.destroy

SELECT  `directors`.* FROM `directors`  WHERE `directors`.`id` = 6 LIMIT 1
---
  def show
    @director = Director.find(params[:id])

SELECT `directors`.* FROM `directors`
---
  def index
    @directors = Director.all