eshop3/app/controllers/admin/film_controller.rb

  def create
    @film = Film.new(film_params)
    if @film.save
---
INSERT INTO `films` (`blurb`, `cod`, `cover_image_content_type`, `cover_image_file_name`, `cover_image_file_size`, `cover_image_updated_at`, `created_at`, `duration`, `price`, `produced_at`, `producer_id`, `title`, `updated_at`) VALUES ('Radical', '123', 'image/jpeg', 'dark_souls_3.jpg', 1987140, '2016-05-09 08:23:56', '2016-05-09 08:23:58', 90, 40.0, '2016-05-09 00:00:00', 1, 'Dark Souls 3', '2016-05-09 08:23:58')

  def edit
    load_data
    @film = Film.find(params[:id])
---
SELECT  `films`.* FROM `films`  WHERE `films`.`id` = 1 LIMIT 1

  def update
    @film = Film.find(params[:id])
    if @film.update_attributes(film_params)
---
SELECT  `films`.* FROM `films`  WHERE `films`.`id` = 1 LIMIT 1
UPDATE `films` SET `blurb` = 'A very new Book of Ruby', `cod` = '160', `duration` = 350, `price` = 50.0, `produced_at` = '2016-05-04 18:28:20', `title` = 'A very new Book of Ruby', `updated_at` = '2016-05-04 18:28:20' WHERE `films`.`id` = 35

  def destroy
    @film = Film.find(params[:id])
    @film.destroy
---
SELECT  `films`.* FROM `films`  WHERE `films`.`id` = 1 LIMIT 1
DELETE FROM `films` WHERE `films`.`id` = 1

  def show
    @film = Film.find(params[:id])
---
SELECT  `films`.* FROM `films`  WHERE `films`.`id` = 1 LIMIT 1

  def index
    sort_by = params[:sort_by]
    @films = Film.order(sort_by).paginate(:page => params[:page], :per_page => 5)
---
SELECT  `films`.* FROM `films`  LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `films`

    def load_data
      @directors = Director.all
      @producers = Producer.all
---
SELECT `directors`.* FROM `directors`
SELECT `producers`.* FROM `producers`