eshop3/app/controllers/admin/order_controller.rb

  def close
    order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 5 LIMIT 1

  def show
    @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders`  WHERE `orders`.`id` = 4 LIMIT 1

  def index
    @status = params[:id]
    if @status.blank?
      @status = 'todos'
      conditions = nil
    else
      conditions = "status = '#{@status}'"
    end
    @orders = Order.where(conditions).paginate(:page => params[:page], :per_page => 10)
---
SELECT  `orders`.* FROM `orders`  WHERE (status = 'open') LIMIT 10 OFFSET 0