eshop3/app/controllers/admin/producer_controller.rb

  def create
    @producer = Producer.new(producer_params)
    if @producer.save
---
INSERT INTO `producers` (`created_at`, `name`, `updated_at`) VALUES ('2016-04-26 08:43:10', 'Warner Bros', '2016-04-26 08:43:10')

  def edit
    @producer = Producer.find(params[:id])
---
SELECT  `producers`.* FROM `producers`  WHERE `producers`.`id` = 1 LIMIT 1

  def update
    @producer = Producer.find(params[:id])
    if @producer.update_attributes(producer_params)
---
SELECT  `producers`.* FROM `producers`  WHERE `producers`.`id` = 1 LIMIT 1
UPDATE `producers` SET `name` = 'Joseph', `updated_at` = '2016-04-26 07:34:27' WHERE `producers`.`id` = 1

  def destroy
    @producer = Producer.find(params[:id])
    @producer.destroy
---
SELECT  `producers`.* FROM `producers`  WHERE `producers`.`id` = 1 LIMIT 1
DELETE FROM `producers` WHERE `producers`.`id` = 1

  def show
    @producer = Producer.find(params[:id])
---
SELECT  `producers`.* FROM `producers`  WHERE `producers`.`id` = 1 LIMIT 1

  def index
    @producers = Producer.all
---
SELECT `producers`.* FROM `producers`