eshop3/app/controllers/cart_controller.rb

  def add
    @film = Film.find params[:id]
---
SELECT  `films`.* FROM `films`  WHERE `films`.`id` = 4 LIMIT 1

  def remove
    @film = Film.find params[:id]
---
SELECT  `films`.* FROM `films`  WHERE `films`.`id` = 4 LIMIT 1

  def clear
    @page_title = 'Vaciar carrito'
    if request.post?
      @cart.cart_items.destroy_all
---
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 5