eshop3/app/controllers/catalog_controller.rb

SELECT  `films`.* FROM `films`  WHERE `films`.`id` = 1 LIMIT 1
---
  def show
    @film = Film.find(params[:id])

SELECT  `films`.* FROM `films`   ORDER BY films.id desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `films`
SELECT `directors`.* FROM `directors`  WHERE `directors`.`id` IN (2)
SELECT `producers`.* FROM `producers`  WHERE `producers`.`id` IN (1)
---
  def index
    @films = Film.order("films.id desc").includes(:directors, :producer).paginate(:page => params[:page], :per_page => 5)