eshop3/app/controllers/checkout_controller.rb

  def index
    @order = Order.new
    @page_title = 'Formulario de pago'
    if @cart.films.empty?
---
SELECT  1 AS one FROM `films` INNER JOIN `cart_items` ON `films`.`id` = `cart_items`.`film_id` WHERE `cart_items`.`cart_id` = 1 LIMIT 1

  def submit_order
    @cart = Cart.find(params[:cart][:id]) # Search the cart from the cart id hidden field of the form
    @order = Order.new(order_params)
    @order.ship_to_country_code = @order.ship_to_country_code.upcase
    @order.customer_ip = request.remote_ip
    @order.status = 'abierto'
    @page_title = 'Formulario de pago'
    populate_order

    if @order.save
      if @order.process
        flash[:notice] = 'Su pedido será procesado inmediatamente.'
        session[:order_id] = @order.id
        @cart.cart_items.destroy_all # empty shopping cart
---
SELECT  `carts`.* FROM `carts`  WHERE `carts`.`id` = 1 LIMIT 1
INSERT INTO `orders` (`created_at`, `customer_ip`, `email`, `phone_number`, `ship_to_address`, `ship_to_city`, `ship_to_country_code`, `ship_to_first_name`, `ship_to_last_name`, `ship_to_postal_code`, `status`, `updated_at`) VALUES ('2016-05-03 10:10:22', '127.0.0.1', 'joseantonio.caravacadiosdado@alum.uca.es', '680603491', 'owidbs', 'asid', 'ES', 'juan', 'boubeta', '11403', 'open', '2016-05-03 10:10:22')
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 3