eshop3/app/controllers/user_controller.rb

SELECT COUNT(*) FROM `users`
---
  def new
    @user = User.new
    @page_title = 'Crear nueva cuenta'
    if current_user
      flash[:notice] = 'Solo una cuenta puede ser creada.'
      redirect_to :controller => 'about', :action => 'index'
    else
      # only when there are no accounts it allows to create a new one, unique in the system
      redirect_to :controller => 'user_sessions', :action => 'new' unless User.count == 0

INSERT INTO `users` (`created_at`, `crypted_password`, `current_login_at`, `current_login_ip`, `email`, `last_request_at`, `login`, `login_count`, `name`, `password_salt`, `perishable_token`, `persistence_token`, `updated_at`) VALUES ('2016-05-10 09:18:22', '0d227246f6fab9a99a18c48dc932943cfe5d4382c452e0d97dd71d2f39aeccb42fd73f0ed2e6943dbbab77ac2c0170bebc4c221d86d5fb7528f49ce8aaf27dc5', '2016-05-10 09:18:22', '127.0.0.1', 'admin@uca.es', '2016-05-10 09:18:22', 'admin', 1, 'David', 'QljY4pENeUlgVwd9HkB', 'KTegZXCYunUOdOStXif1', '7fdbdec8b4431f6b34f060d7c0f7fcee06f4aaffb12036a6dff96f22c65d0576ea9144fd4d79eac29eb1b47e1e58ce70f934198de2d5fd0348f917cec7c17efc', '2016-05-10 09:18:22')
---
  def create
    @user = User.new(user_params)
    if @user.save # the new user has been logged in automatically

UPDATE `users` SET `crypted_password` = 'db4b33121e31259f8ceb89224b5680bd01a8861db2fefebc197cb58b2f3481ff2e4a7f2d15eb88f2d9949f38a5a7c77bb85219ebc7849ea1dd1d614ce5b10016', `current_login_at` = '2016-05-10 09:46:14', `last_login_at` = '2016-05-10 09:46:14', `last_login_ip` = '127.0.0.1', `last_request_at` = '2016-05-10 09:46:14', `login_count` = 2, `name` = 'George Jackson', `password_salt` = '2gzmcioEoUF79tSJbb', `perishable_token` = '1Q92xcKSotszQZSJRNih', `persistence_token` = 'c008ed9011211478e7d8c68965ef68f219ba7caa622e4d088db02b5afce5c98655df63e30fcf4aa44183839cd85f571e7a16275d33b39ae3ce46a833d6748e31', `updated_at` = '2016-05-10 09:46:14' WHERE `users`.`id` = 2
---
  def update
    @user = current_user
    if @user.update_attributes(user_params)