eshop3/app/views/admin/film/_form.html.erb

  <p><label for="film[director_ids][]">Directores</label><br/>
  <%= select_tag 'film[director_ids][]', options_from_collection_for_select(@directors, :id, :name,
      @film.directors.collect{|director| director.id}), { :multiple => true, :size => 5 } %></p>
---
SELECT `directors`.* FROM `directors` INNER JOIN `directors_films` ON `directors`.`id` = `directors_films`.`director_id` WHERE `directors_films`.`film_id` = 1